{
  "NURS 8123 Feasibility Report - Dorthia Daudier.docx": "Arkansas State University \nCollege of Nursing and Health Professions \nSchool of Nursing \nFeasibility Study & Project Proposal\nStudents are expected to complete a needs assessment and determine if the project is doable (feasible) at their project site. This document will assist the student in determining what process problems or policy issues need to be addressed at the project site (not global) and can be improved through quality improvement implementation.  \nReferences\nAlbertson, E. M., Chuang, E., O’Masta, B., Lye, I. M., Haley, L. A., & Pourat, N. (2021). Systematic Review of Care Coordination Interventions Linking Health and Social Services for High-Utilizing Patient Populations. Population Health Management, 25(1), 73–85. \nBlumenthal, D., Anderson, G., Burke, S., Fulmer, T., Jha, A. K., & Long, P. (2024, December 30). Tailoring Complex-Care Management, Coordination, and Integration for High-Need, High-Cost Patients: A Vital Direction for Health and Health Care - NAM. NAM. \nConnor, L. (2023). Evidence‐Based Practice Improves Patient Outcomes and Healthcare System Return on investment: Findings from a Scoping Review. Worldviews on Evidence-Based Nursing, 20(1), 6–15. \nHonsberger, E. G., Kate. (2022, June 28). Aligning Quality Measures with the National Care Coordination Standards for Children and Youth with Special Health Care Needs (CYSHCN). NASHP. \nMay 2025 ACO REACH Model PY 2025 Quality Measurement Methodology Report. (2025). \nMöckli, N., Simon, M., Denhaerynck, K., Martins, T., Meyer-Massetti, C., Fischer, R., & Zúñiga, F. (2023). Care coordination in homecare and its relationship with quality of care: A national multicenter cross-sectional study. International Journal of Nursing Studies, 145, 104544. \nTaskforce on Telehealth Policy (TTP) - Data Flow, Care Coordination and Quality Measurement - NCQA. (2020, September 15). NCQA. \nWieczorek-Wójcik, B., Milewska, A. J., Dorota Kilańska, Aneta Kulma-Pytlak, Iltchev, P., Aleksandra Gaworska-Krzemińska, & Kozlowski, R. (2025). Patient Perspectives on Coordinated Care: Preliminary Results from the Implementation Stage Using Patient-Reported Experience Measures (PREMs). Healthcare, 13(9), 1026–1026. \n[TABLE] Components \n[TABLE] Responses \n \n[TABLE] NURS 8123 LEADERSHIP \nPROJECT PROPOSAL\n[TABLE] Project Committee: \nPrincipal Investigator (student name): \nPractice Partner Name and Degree: \nProject Site (review approved states for the program : \n \n[TABLE]  \nDorthia Daudier\n\nDr. Marie G. Martin, EDD\n\nIndependent Living Systems (ILS)\nTexas Office \n\n[TABLE] Needs Assessment \n(REVIEW VIDEOS ON THIS TOPIC): Discuss how you obtained information, who you interviewed, what resources, and data supported the need. Provide facts or data based on needs assessment\n[TABLE] The needs assessment for this project was conducted through a combination of data review, stakeholder interviews, and resource evaluation. Information was obtained by analyzing internal call logs and outreach reports for a 3-month baseline period (June–August 2025) at the ILS Texas site, focusing on first-contact attempts with members. Interviews were conducted with care coordinators, case management supervisors, and leadership to understand workflow challenges and barriers to timely contact. Additionally, performance metrics related to member engagement and outreach success rates were reviewed to quantify the scope of the issue. The combined data showed that approximately 40% of initial outreach attempts were unsuccessful or delayed, mainly due to outdated member contact information and inconsistent documentation procedures. These findings, supported by both staff qualitative input and quantitative performance data, underscore the need for a standardized, timely outreach protocol to improve care coordination for members.\n[TABLE] Identified Problem and\nProblem Statement/Must include aim of project:\n[TABLE]  The identified problem at the ILS site involves inconsistent and ineffective first-contact attempts with program members. This issue results in delayed care coordination and diminished member engagement, which adversely affects timely access to necessary health services. Despite available resources, the lack of a standardized outreach protocol and incomplete member contact information contribute significantly to these practice gaps.\nThe problem statement is: Among Care Plan members at the ILS care coordination site, inconsistent and delayed first contact attempts by care coordinators contribute to reduced engagement in care management services and compromise timely care delivery. There is a critical need to establish and implement a standardized outreach protocol to improve the efficiency and success rate of initial member contact.\nThis project aims to increase the successful first-contact rate with members from the current baseline of approximately 60% to 85% within three months by developing and deploying a standardized initial outreach workflow that includes verifying contact information, timely follow-up, and documentation accountability. This improvement is expected to enhance member engagement and facilitate more effective care coordination.\n\n[TABLE] Project Category \n[TABLE] Which of these categories best describes your project? \n☐ EBP Projects: ** EBP projects involve using research and evidence to guide practice changes. Practices are outdated or nonexistent. Example: Medication Reconciliation or Fall Prevention protocols. Advancing the Nursing Profession: Creating professional development assessment tools.\n\n☐ Program Development: Focuses on creating structured initiatives to support and implement EBP at a larger scale. These projects often involve mentorship, training, and use resource allocation to implement EBP into a larger organization (AI, 2025). Example: Malignant hyperthermia preparedness program, creating apps, curriculum development, community health initiatives\n\nX Needs Assessment/QI: The goal is to evaluate the current or baseline level of performance at the project site and implement and evaluate quality improvement initiatives. Need is based on evidence such as data.  Examples include reducing medical errors, hospital-acquired infections, patient flow, and equity in care. \n☐ Policy Project: ** Checking this box states that your project site (facility) uses formal policies for practice or process. You are stating that 1. Creating an actual formal policy or editing an existing policy based on evidence-based practice, or current standards 2. Obtaining approval from the administration for the new change, 3. Implementing part of or the whole policy, 4. Measuring outcome(s). You are using the QI method to develop and implement your project. If you are not doing this, then review other options.\n ** Please note: Due to the complexity of IRB, you will not have direct contact with patients or students. \n[TABLE] Setting: Specifically, where is the Project Site? Hospital? Clinic? \nGovernment?  \n[TABLE]  ILS is a managed care organization and health care provider that provides care and social services to complex populations in the Medicare, Medicaid, and Dual-Eligible markets throughout the USA. \n[TABLE] What is the gap between practice as it is and EBP? \n[TABLE] The gap between current practice and evidence-based practice (EBP) lies in the inconsistent application of the best available research, clinical expertise, and patient preferences in delivering care. In many healthcare settings, including the ILS managed care site, current practices, such as first-contact attempts with members, are often delayed or incomplete due to a lack of standardized protocols and outdated member information. EBP requires integrating up-to-date, scientifically validated interventions with clinical judgment and consideration of patients' values to ensure optimal outcomes. However, this ideal is not always realized in practice due to barriers such as resistance to change, insufficient training, administrative challenges, and workflow inconsistencies. Consequently, a significant practice gap persists where care delivery does not consistently reflect evidence-based standards, leading to suboptimal patient engagement and outcomes. Closing this gap is essential to improving the quality and safety of care by ensuring timely, effective, and patient-centered coordination (American Nurses Association, 2023).\nThis gap highlights the need to implement a standardized, evidence-informed outreach protocol at the ILS site to align practice with the best evidence and improve the success rate and timeliness of initial member contact.\n\n[TABLE] How does the project impact the problem? \n[TABLE]  The project directly addresses the identified problem by implementing a standardized, evidence-based outreach protocol to improve the timeliness and effectiveness of first contact with members. Improved care coordination has been shown to positively impact multiple aspects of healthcare quality, including increased receipt of preventive services, better clinical outcomes, and enhanced patient satisfaction. By ensuring timely and consistent initial member contact, this project promotes coordinated communication among providers and patients, decreases care fragmentation, and supports timely follow-up with necessary services. Such improvements in care coordination, supported by extensive research, are associated with higher-quality clinical care and better health outcomes for patients. Therefore, this project’s intervention aligns practice more closely with evidence-based standards, enabling measurable improvements in member engagement and care continuity, ultimately contributing to better clinical processes and outcomes (Connor, 2023).\n\n[TABLE] EBP Intervention; Based on gold standards, supported by research. Intervention must be supported by literature review. Include minimum of 5 references for this section.\n\n[TABLE]  The evidence-based practice (EBP) intervention for this project involves implementing a standardized care coordination outreach protocol that aligns with the gold-standard elements identified in recent research. This intervention includes timely first-contact attempts within 48 hours of referral, systematic verification and updating of member contact information, consistent documentation, and the use of accountability tools, such as automated reminders. Research shows that key components of successful care coordination programs include thorough patient needs assessment, individualized care planning, in-person and telephonic patient engagement, and standardized care coordination protocols (Albertson et al., 2021). These elements are critical to promoting communication across healthcare and social services, improving patient outcomes, and reducing hospitalizations (Wieczorek-Wójcik et al., 2025).\nStudies also emphasize the importance of patient engagement strategies that support self-management and ongoing monitoring, which are achieved through regular, structured communication (Wieczorek-Wójcik et al., 2025). Nurse-led coordination and interdisciplinary collaboration enhance the navigation of complex care systems, contributing to improved symptom management and overall health outcomes (Blumenthal et al., 2024). Systematic reviews confirm that integrating these processes within care coordination interventions leads to enhanced quality of care and patient satisfaction (Connor, 2023). The intervention's focus on standardized workflows with accountability mechanisms is supported by evidence demonstrating that targeted coordination improves continuity, patient safety, and efficiency in care delivery (Möckli et al., 2023).\n\n\n\n[TABLE] Simple Title of Project (Title should be same on feasibility document, DNP Project paper, site permission letter, and IRB)\n[TABLE]  \"Improving Initial Care Coordination Outreach for Members at ILS \"\n\n[TABLE] PICO Statement \n[TABLE] P (Population/Problem): Members enrolled in the Plan of Focus (POF) program at ILS Texas requiring care coordination\n\nI (Intervention): Implementation of a standardized initial outreach protocol including timely contact attempts, verification of member information, and documented follow-up\n\nC (Comparison): Current inconsistent and non-standardized first contact outreach processes\n\nO (Outcome): Increased successful first contact rate and improved timeliness of care coordination initiation within three months\nPICO Question:\nIn members enrolled in the Care Coordination program at ILS, how does implementing a standardized initial outreach protocol compared to current inconsistent outreach practices affect the success rate and timeliness of first contact and care coordination initiation over a three-month period?\n\n[TABLE] Instrument (s) to measure outcomes\n[TABLE] To measure outcomes for this quality improvement project, several validated instruments and data sources can be used to assess the effectiveness of the care coordination intervention:\nCare Management Dashboard and Outreach Logs: Electronic health record (EHR) or care management system reports tracking the number and timeliness of first contact attempts and documenting outcomes of each outreach effort. This tool allows quantitative measurement of the successful first contact rate (Taskforce on Telehealth Policy (TTP) - Data Flow, Care Coordination and Quality Measurement - NCQA, 2020).\n\nCare Coordination Measures Atlas (AHRQ): A compendium of validated care coordination process and outcome measures that can guide data collection on activities such as referral tracking, information sharing, and patient engagement (Honsberger, 2022).\nStaff Compliance Audits: Periodic review of care coordinators’ documentation to ensure adherence to the outreach protocol and documentation standards (Honsberger, 2022).\nQuality Improvement Monitoring Tools: Use of performance dashboards and regular report summaries, such as the Care Team Insights or Care Coordination Applications, to monitor ongoing trends and effectiveness of interventions (May 2025 ACO REACH Model PY 2025 Quality Measurement Methodology Report, 2025).\nThese instruments collectively enable both quantitative and qualitative evaluation of the intervention's impact on care coordination processes and member engagement.\n\n[TABLE] Site Permission and Practice Partner Agreement\n[TABLE]  Submitted to Workroom: ⃝ Not submitted (please contact the project chair and the Director) : ⃝ \n\n\n[TABLE] Project Proposal Decision:\n[TABLE] Draft Accepted ⃝ Revisement Necessary: ⃝ Comment for Revisement: \n\nFinal Version Graded Assignment: Approved ⃝ Revisement \nNecessary: ⃝ \nComment for Revisement:  \n",
  "NURS 8123 Feasibility Report - Dorthia Daudier.docx_sections": [
    "Problem Statement",
    "Feasibility",
    "Measurement",
    "Evaluation",
    "Timeline",
    "Evidence",
    "Comment"
  ],
  "DDaudier - Feasibility Revised.docx": "Arkansas State University \nCollege of Nursing and Health Professions \nSchool of Nursing \nFeasibility Study & Project Proposal\nStudents are expected to complete a needs assessment and determine if the project is doable (feasible) at their project site. This document will assist the student in determining what process problems or policy issues need to be addressed at the project site (not global) and can be improved through quality improvement implementation.  \nReferences\nAlbertson, E. M., Chuang, E., O’Masta, B., Lye, I. M., Haley, L. A., & Pourat, N. (2021). Systematic Review of Care Coordination Interventions Linking Health and Social Services for High-Utilizing Patient Populations. Population Health Management, 25(1), 73–85. \nBlumenthal, D., Anderson, G., Burke, S., Fulmer, T., Jha, A. K., & Long, P. (2024, December 30). Tailoring Complex-Care Management, Coordination, and Integration for High-Need, High-Cost Patients: A Vital Direction for Health and Health Care - NAM. NAM. \nConnor, L. (2023). Evidence‐Based Practice Improves Patient Outcomes and Healthcare System Return on investment: Findings from a Scoping Review. Worldviews on Evidence-Based Nursing, 20(1), 6–15. \nHonsberger, E. G., Kate. (2022, June 28). Aligning Quality Measures with the National Care Coordination Standards for Children and Youth with Special Health Care Needs (CYSHCN). NASHP. \nMay 2025 ACO REACH Model PY 2025 Quality Measurement Methodology Report. (2025). \nMöckli, N., Simon, M., Denhaerynck, K., Martins, T., Meyer-Massetti, C., Fischer, R., & Zúñiga, F. (2023). Care coordination in homecare and its relationship with quality of care: A national multicenter cross-sectional study. International Journal of Nursing Studies, 145, 104544. \nTaskforce on Telehealth Policy (TTP) - Data Flow, Care Coordination and Quality Measurement - NCQA. (2020, September 15). NCQA. \nWieczorek-Wójcik, B., Milewska, A. J., Dorota Kilańska, Aneta Kulma-Pytlak, Iltchev, P., Aleksandra Gaworska-Krzemińska, & Kozlowski, R. (2025). Patient Perspectives on Coordinated Care: Preliminary Results from the Implementation Stage Using Patient-Reported Experience Measures (PREMs). Healthcare, 13(9), 1026–1026. \n[TABLE] Components \n[TABLE] Responses \n \n[TABLE] NURS 8123 LEADERSHIP \nPROJECT PROPOSAL\n[TABLE] Project Committee: \nPrincipal Investigator (student name): \nPractice Partner Name and Degree: \nProject Site (review approved states for the program : \n \n[TABLE]  \nDorthia Daudier\n\nDr. Marie G. Martin, EDD\n\nIndependent Living Systems (ILS) is a managed care provider that offers services such as personalized Medicare and Medicaid plans, home care services, care management, and support programs designed to help individuals live independently. The services include health plan support, provider networks, and direct assistance to individuals, with a focus on non-institutional settings such as living at home or in community apartments, rather than licensed facilities.\nTexas Office \n\n[TABLE] Needs Assessment \n(REVIEW VIDEOS ON THIS TOPIC): Discuss how you obtained information, who you interviewed, what resources, and data supported the need. Provide facts or data based on needs assessment\n[TABLE] The needs assessment for this project was conducted through a combination of data review, stakeholder interviews, and resource evaluation. Information was obtained by analyzing internal call logs and outreach reports for a 3-month baseline period (June–August 2025) at the ILS Texas site, with a focus on first-contact attempts with members. The first-time contact attempts were specifically made to initiate timely and successful first contact with members, aiming to engage them in care coordination activities. Interviews were conducted with care coordinators, case management supervisors, and leadership to understand workflow challenges and barriers to timely contact. Additionally, performance metrics related to member engagement and outreach success rates were reviewed to quantify the scope of the issue. The supporting data indicated that about 40% of these initial outreach attempts were either unsuccessful or delayed. Key reasons included outdated member contact information and inconsistent documentation practices, which caused barriers to timely engagement. \nThis is a critical issue because unsuccessful or delayed first contact compromises care coordination, delaying needed interventions and support for vulnerable members. Without early and reliable outreach, members may miss essential services, resulting in poorer health outcomes and increased resource utilization. The quality improvement project addresses this problem by developing a standardized and timely outreach protocol to ensure consistent and efficient member engagement. This evidence-based intervention is supported by both qualitative input from staff interviews and quantitative performance data, which reviews outreach success rates, highlighting the need to improve communication workflows and the accuracy of contact information to enhance overall care coordination effectiveness. The project aims to reduce delays and increase successful contacts, thereby directly impacting member health and the quality-of-service delivery.\n\n[TABLE] Identified Problem and\nProblem Statement/Must include aim of project:\n[TABLE]  Among managed care members at the ILS care coordination site (population), inconsistent and delayed first-contact attempts by care coordinators (problem) contribute to reduced engagement in care management services and compromise timely care delivery (impact). Despite available resources, the absence of a standardized outreach protocol and incomplete member contact information (practice gap) hinders effective and efficient initial outreach efforts. There is a critical need to develop and implement a standardized outreach protocol to improve first-contact efficiency, accuracy, and documentation accountability to enhance member engagement and care coordination outcomes.\nThis project aims to impact the successful first-contact rate with members by improving from the current baseline of approximately 60% to 85% within three months through the development and deployment of a standardized initial outreach workflow that includes verifying contact information, timely follow-up, and documentation accountability. This improvement is expected to positively impact member engagement and facilitate more effective care coordination.\n\n\n[TABLE] Project Category \n[TABLE] Which of these categories best describes your project? \n☐ EBP Projects: ** EBP projects involve using research and evidence to guide practice changes. Practices are outdated or nonexistent. Example: Medication Reconciliation or Fall Prevention protocols. Advancing the Nursing Profession: Creating professional development assessment tools.\n\n☐ Program Development: Focuses on creating structured initiatives to support and implement EBP at a larger scale. These projects often involve mentorship, training, and use resource allocation to implement EBP into a larger organization (AI, 2025). Example: Malignant hyperthermia preparedness program, creating apps, curriculum development, community health initiatives\n\nX Needs Assessment/QI: The goal is to evaluate the current or baseline level of performance at the project site and implement and evaluate quality improvement initiatives. Need is based on evidence such as data.  Examples include reducing medical errors, hospital-acquired infections, patient flow, and equity in care. \n☐ Policy Project: ** Checking this box states that your project site (facility) uses formal policies for practice or process. You are stating that 1. Creating an actual formal policy or editing an existing policy based on evidence-based practice, or current standards 2. Obtaining approval from the administration for the new change, 3. Implementing part of or the whole policy, 4. Measuring outcome(s). You are using the QI method to develop and implement your project. If you are not doing this, then review other options.\n ** Please note: Due to the complexity of IRB, you will not have direct contact with patients or students. \n[TABLE] Setting: Specifically, where is the Project Site? Hospital? Clinic? \nGovernment?  \n[TABLE] Independent Living Systems (ILS) is a managed care organization and healthcare provider that focuses on delivering coordinated medical and social services to complex populations, primarily in the Medicare, Medicaid, and Dual-Eligible markets across the United States, including Texas (Independent Living Systems, 2024). \n[TABLE] What is the gap between practice as it is and EBP? \n[TABLE] The ILS Texas site faces serious challenges in conducting timely and effective first-contact attempts with members, primarily because there are no standardized outreach protocols in place and the member contact information is often outdated. This situation causes delays and gaps in engaging members at critical initial points of care, undermining efforts to coordinate care effectively. Without consistent member contact, care teams struggle to ensure patients receive the services they need, resulting in diminished patient participation and poorer health outcomes, particularly among ILS’s complex, high-risk populations who depend on coordinated support.\nThese operational shortcomings are compounded by systemic issues prevalent in Texas Medicaid managed care, including fragmented communication processes, limited integration with community-based organizations, and burdensome administrative requirements (THCA, 2019). For instance, insufficient data sharing and a lack of streamlined referral systems make it challenging to track member needs and follow up on actions. Additionally, variability in plan requirements and inconsistent workflows contribute to confusion and inefficiency among providers attempting to engage members (THCA, 2019). Texas initiatives recommend enhancing partnerships with community organizations, improving data infrastructure, and streamlining administrative processes to overcome these barriers and support timely engagement (Episcopal Health Foundation, 2022). Furthermore, lessons from managed care learning collaboratives emphasize the importance of employing multiple, targeted outreach strategies, such as phone calls and text messaging, which have demonstrated improved success in member engagement (Dwyer, 2025). However, such approaches remain underutilized or inconsistently applied at the ILS Texas site, thereby prolonging delays and reducing the effectiveness of outreach.\nThe problem at the ILS Texas site revolves around fragmented outreach efforts, outdated contact information, and the absence of consistent protocols. These factors impede care coordination and patient engagement, limiting the organization’s ability to deliver evidence-based, patient-centered care that meets the complex needs of its membership.\n\n[TABLE] How does the project impact the problem? \n[TABLE] The project directly targets the problem at the ILS Texas site by implementing a standardized, evidence-based outreach protocol designed to improve the timeliness and effectiveness of first-contact attempts with members. This approach establishes structured workflows and ensures the use of up-to-date member contact information, aiming to eliminate delays and inconsistencies that currently hinder member engagement. Improved timeliness and effectiveness in outreach will facilitate more coordinated care, increase patient participation, and ultimately lead to better health outcomes for ILS’s high-risk populations.\nMeasurement of both timeliness and effectiveness is integral to the project. Timeliness can be quantified by tracking the duration between member enrollment or referral and the first successful contact attempt. Effectiveness will be assessed through metrics such as the proportion of successful member contacts, levels of sustained engagement, and patient satisfaction regarding the outreach process. These performance indicators will be continuously monitored, supporting data-driven decision-making and enabling the organization to refine its outreach strategies as needed. \n[TABLE] EBP Intervention; Based on gold standards, supported by research. Intervention must be supported by literature review. Include minimum of 5 references for this section.\n\n[TABLE] The evidence-based practice (EBP) intervention for this project involves implementing a standardized care coordination outreach protocol that incorporates key elements identified as gold standards in recent research. This intervention includes making timely first-contact attempts within 48 hours of referral, systematically verifying and updating member contact information, maintaining consistent documentation, and using accountability tools such as automated reminders to support workflow adherence.\nSpecifically, the project will engage care coordinators and outreach workers to conduct thorough patient needs assessments, develop individualized care plans, and use both in-person and telephonic methods to engage members. These coordinated outreach efforts will occur at the ILS Texas site immediately following member referral or enrollment, aiming to overcome existing barriers in communication and engagement. The workflow will be supported by electronic health record tools that prompt timely outreach activities and require documented attempts and outcomes.\nResearch supports the notion that effective care coordination programs emphasize patient-centered engagement strategies, which support self-management and ongoing monitoring through regular, structured communication (Wieczorek-Wójcik et al., 2025). Clinical-led coordination and interdisciplinary collaboration are linked with improved symptom management and overall health outcomes (Blumenthal et al., 2024). Systematic reviews confirm that integrating these core processes enhances care quality and patient satisfaction (Connor, 2023). Additionally, the use of standardized workflows coupled with accountability mechanisms has been shown to improve continuity, patient safety, and efficiency in care delivery (Möckli et al., 2023). Outreach workers embedded within care coordination teams can address the psychosocial and cultural needs of the populations they serve, thereby boosting trust and adherence to care plans (Outreach Partners, 2019). These interventions directly target the existing gaps in timeliness and consistency at the ILS Texas site.\n\n\n[TABLE] Simple Title of Project (Title should be same on feasibility document, DNP Project paper, site permission letter, and IRB)\n[TABLE] The Impact of Care Coordination among Staff at a Managed Care Organization\n\n\n[TABLE] PICO Statement \n[TABLE] Here is a PICO statement based on your project:\nP (Population): Staff members (licensed providers and outreach workers) at a managed care organization serving complex, high-risk Medicare, Medicaid, and Dual-Eligible populations at the ILS Texas site.\nI (Intervention): Implementation of a standardized initial outreach protocol, including timely first-contact attempts within 48 hours, systematic verification and updating of member contact information, standardized documentation, and accountability tools.\nC (Comparison): Current outreach practices, characterized by inconsistent first-contact attempts, lack of standardized protocols, and use of outdated member information.\nO (Outcome): Improved success rate and timeliness of first contact with members, measured by increased percentage of successful first contacts within 48 hours, and enhanced initiation of care coordination documented within 72 hours; additionally, improved staff confidence and self-efficacy in outreach tasks measured by valid, reliable survey tools.\nPICO Question: Among licensed staff at a managed care organization serving complex populations, how does implementing a standardized initial outreach protocol compared to current inconsistent outreach practices impact the success rate and timeliness of first contact and initiation of care coordination over a three-month period?\nThis PICO framework provides a clear, evidence-based question to guide the project and related literature search.\nSources for PICO framework structure: ASHA (1996), National Library of Medicine (2015), Duke University Medical Center (2011).​\nIf desired, the question can be expanded with a time component to form PICOT:\n... impact the success rate and timeliness of first contact and care coordination initiation over three months?\nThis structure supports focused inquiry and systematic evaluation of intervention effectiveness.\n\n[TABLE] Instrument (s) to measure outcomes\n[TABLE] \nTo measure outcomes for this quality improvement project, several validated instruments and data sources can be used to assess the effectiveness of the care coordination intervention:\nCare Management Dashboard and Outreach Logs: Electronic health record (EHR) or care management system reports tracking the number and timeliness of first contact attempts and documenting outcomes of each outreach effort. This tool allows quantitative measurement of the successful first contact rate (Taskforce on Telehealth Policy (TTP) - Data Flow, Care Coordination and Quality Measurement - NCQA, 2020).\n\nCare Coordination Measures Atlas (AHRQ): A compendium of validated care coordination process and outcome measures that can guide data collection on activities such as referral tracking, information sharing, and patient engagement (Honsberger, 2022).\nStaff Compliance Audits: Periodic review of care coordinators’ documentation to ensure adherence to the outreach protocol and documentation standards (Honsberger, 2022).\nQuality Improvement Monitoring Tools: Use of performance dashboards and regular report summaries, such as the Care Team Insights or Care Coordination Applications, to monitor ongoing trends and effectiveness of interventions (May 2025 ACO REACH Model PY 2025 Quality Measurement Methodology Report, 2025).\nThese instruments collectively enable both quantitative and qualitative evaluation of the intervention's impact on care coordination processes and member engagement.\n\n[TABLE] Site Permission and Practice Partner Agreement\n[TABLE]  Submitted to Workroom: ⃝ Not submitted (please contact the project chair and the Director) : ⃝ \n\n\n[TABLE] Project Proposal Decision:\n[TABLE] Draft Accepted ⃝ Revisement Necessary: ⃝ Comment for Revisement: \n\nFinal Version Graded Assignment: Approved ⃝ Revisement \nNecessary: ⃝ \nComment for Revisement:  \n",
  "DDaudier - Feasibility Revised.docx_sections": [
    "PICOT",
    "Problem Statement",
    "Feasibility",
    "Measurement",
    "Evaluation",
    "Timeline",
    "Evidence",
    "Framework",
    "Self-Efficacy",
    "Comment"
  ],
  "Dorthia Daudier Feasibility Draft (1).docx": "Arkansas State University \nCollege of Nursing and Health Professions \nSchool of Nursing \nFeasibility Study & Project Proposal\nStudents are expected to complete a needs assessment and determine if the project is doable (feasible) at their project site. This document will assist the student in determining what process problems or policy issues need to be addressed at the project site (not global) and can be improved through quality improvement implementation.  \nReferences\nAlbertson, E. M., Chuang, E., O’Masta, B., Lye, I. M., Haley, L. A., & Pourat, N. (2021). Systematic Review of Care Coordination Interventions Linking Health and Social Services for High-Utilizing Patient Populations. Population Health Management, 25(1), 73–85. \nBlumenthal, D., Anderson, G., Burke, S., Fulmer, T., Jha, A. K., & Long, P. (2024, December 30). Tailoring Complex-Care Management, Coordination, and Integration for High-Need, High-Cost Patients: A Vital Direction for Health and Health Care - NAM. NAM. \nConnor, L. (2023). Evidence‐Based Practice Improves Patient Outcomes and Healthcare System Return on investment: Findings from a Scoping Review. Worldviews on Evidence-Based Nursing, 20(1), 6–15. \nHonsberger, E. G., Kate. (2022, June 28). Aligning Quality Measures with the National Care Coordination Standards for Children and Youth with Special Health Care Needs (CYSHCN). NASHP. \nMay 2025 ACO REACH Model PY 2025 Quality Measurement Methodology Report. (2025). \nMöckli, N., Simon, M., Denhaerynck, K., Martins, T., Meyer-Massetti, C., Fischer, R., & Zúñiga, F. (2023). Care coordination in homecare and its relationship with quality of care: A national multicenter cross-sectional study. International Journal of Nursing Studies, 145, 104544. \nTaskforce on Telehealth Policy (TTP) - Data Flow, Care Coordination and Quality Measurement - NCQA. (2020, September 15). NCQA. \nWieczorek-Wójcik, B., Milewska, A. J., Dorota Kilańska, Aneta Kulma-Pytlak, Iltchev, P., Aleksandra Gaworska-Krzemińska, & Kozlowski, R. (2025). Patient Perspectives on Coordinated Care: Preliminary Results from the Implementation Stage Using Patient-Reported Experience Measures (PREMs). Healthcare, 13(9), 1026–1026. \n[TABLE] Components \n[TABLE] Responses \n \n[TABLE] NURS 8123 LEADERSHIP \nPROJECT PROPOSAL\n[TABLE] Project Committee: \nPrincipal Investigator (student name): \nPractice Partner Name and Degree: \nProject Site (review approved states for the program : \n \n[TABLE]  \nDorthia Daudier\n\nDr. Marie G. Martin, EDD\n\nIndependent Living Systems (ILS)\nTexas Office \n\n[TABLE] Needs Assessment \n(REVIEW VIDEOS ON THIS TOPIC): Discuss how you obtained information, who you interviewed, what resources, and data supported the need. Provide facts or data based on needs assessment\n[TABLE] The needs assessment for this project was conducted through a combination of data review, stakeholder interviews, and resource evaluation. Information was obtained by analyzing internal call logs and outreach reports for a 3-month baseline period (June–August 2025) at the ILS Texas site, focusing on first-contact attempts with members. Interviews were conducted with care coordinators, case management supervisors, and leadership to understand workflow challenges and barriers to timely contact. Additionally, performance metrics related to member engagement and outreach success rates were reviewed to quantify the scope of the issue. The combined data showed that approximately 40% of initial outreach attempts were unsuccessful or delayed, mainly due to outdated member contact information and inconsistent documentation procedures. These findings, supported by both staff qualitative input and quantitative performance data, underscore the need for a standardized, timely outreach protocol to improve care coordination for members.\n[TABLE] Identified Problem and\nProblem Statement/Must include aim of project:\n[TABLE]  The identified problem at the ILS site involves inconsistent and ineffective first-contact attempts with program members. This issue results in delayed care coordination and diminished member engagement, which adversely affects timely access to necessary health services. Despite available resources, the lack of a standardized outreach protocol and incomplete member contact information contribute significantly to these practice gaps.\nThe problem statement is: Among are lan members at the ILS care coordination site, inconsistent and delayed first contact attempts by care coordinators contribute to reduced engagement in care management services and compromise timely care delivery. There is a critical need to establish and implement a standardized outreach protocol to improve the efficiency and success rate of initial member contact.\nThis project aims to increase the successful first-contact rate with members from the current baseline of approximately 60% to 85% within three months by developing and deploying a standardized initial outreach workflow that includes verifying contact information, timely follow-up, and documentation accountability. This improvement is expected to enhance member engagement and facilitate more effective care coordination.\n\n\n\n[TABLE] Project Category \n[TABLE] Which of these categories best describes your project? \n☐ EBP Projects: ** EBP projects involve using research and evidence to guide practice changes. Practices are outdated or nonexistent. Example: Medication Reconciliation or Fall Prevention protocols. Advancing the Nursing Profession: Creating professional development assessment tools.\n\n☐ Program Development: Focuses on creating structured initiatives to support and implement EBP at a larger scale. These projects often involve mentorship, training, and use resource allocation to implement EBP into a larger organization (AI, 2025). Example: Malignant hyperthermia preparedness program, creating apps, curriculum development, community health initiatives\n\nX Needs Assessment/QI: The goal is to evaluate the current or baseline level of performance at the project site and implement and evaluate quality improvement initiatives. Need is based on evidence such as data.  Examples include reducing medical errors, hospital-acquired infections, patient flow, and equity in care. \n☐ Policy Project: ** Checking this box states that your project site (facility) uses formal policies for practice or process. You are stating that 1. Creating an actual formal policy or editing an existing policy based on evidence-based practice, or current standards 2. Obtaining approval from the administration for the new change, 3. Implementing part of or the whole policy, 4. Measuring outcome(s). You are using the QI method to develop and implement your project. If you are not doing this, then review other options.\n ** Please note: Due to the complexity of IRB, you will not have direct contact with patients or students. \n[TABLE] Setting: Specifically, where is the Project Site? Hospital? Clinic? \nGovernment?  \n[TABLE]  ILS is a managed care organization and health care provider that provides care and social services to complex populations in the Medicare, Medicaid, and Dual-Eligible markets throughout the USA. \n[TABLE] What is the gap between practice as it is and EBP? \n[TABLE] The gap between current practice and evidence-based practice (EBP) lies in the inconsistent application of the best available research, clinical expertise, and patient preferences in delivering care. In many healthcare settings, including the ILS managed care site, current practices, such as first-contact attempts with members, are often delayed or incomplete due to a lack of standardized protocols and outdated member information. EBP requires integrating up-to-date, scientifically validated interventions with clinical judgment and consideration of patients' values to ensure optimal outcomes. However, this ideal is not always realized in practice due to barriers such as resistance to change, insufficient training, administrative challenges, and workflow inconsistencies. Consequently, a significant practice gap persists where care delivery does not consistently reflect evidence-based standards, leading to suboptimal patient engagement and outcomes. Closing this gap is essential to improving the quality and safety of care by ensuring timely, effective, and patient-centered coordination (American Nurses Association, 2023).\nThis gap highlights the need to implement a standardized, evidence-informed outreach protocol at the ILS site to align practice with the best evidence and improve the success rate and timeliness of initial member contact.\n\n\n[TABLE] How does the project impact the problem? \n[TABLE]  The project directly addresses the identified problem by implementing a standardized, evidence-based outreach protocol to im the timeliness and effectiveness of first contact with members. \n\nImproved care coordination has been shown to positively impact multiple aspects of healthcare quality, including increased receipt of preventive services, better clinical outcomes, and enhanced patient satisfaction. By ensuring timely and consistent initial member contact, this project promotes coordinated communication among providers and patients, decreases care fragmentation, and supports timely follow-up with necessary services. Such improvements in care coordination, supported by extensive research, are associated with higher-quality clinical care and better health outcomes for patients. Therefore, this project’s intervention aligns practice more closely with evidence-based standards, enabling measurable improvements in member engagement and care continuity, ultimately contributing to better clinical processes and outcomes (Connor, 2023).\n\n[TABLE] EBP Intervention; Based on gold standards, supported by research. Intervention must be supported by literature review. Include minimum of 5 references for this section.\n\n[TABLE]  The evidence-based practice (EBP) intervention for this project involves implementing a standardized care coordination outreach protocol that aligns with the gold-standard elements identified in recent research. This intervention includes timely first-contact attempts within 48 hours of referral, systematic verification and updating of member contact information, consistent documentation, and the use of accountability tools, such as automated reminders. Research shows that key components of successful care coordination programs include thorough patient needs assessment, individualized care planning, in-person and telephonic patient engagement, and standardized care coordination protocols (Albertson et al., 2021). These elements are critical to promoting communication across healthcare and social services, improving patient outcomes, and reducing hospitalizations (Wieczorek-Wójcik et al., 2025).\nStudies also emphasize the importance of patient engagement strategies that support self-management and ongoing monitoring, which are achieved through regular, structured communication (Wieczorek-Wójcik et al., 2025). Nurse-led coordination and interdisciplinary collaboration enhance the navigation of complex care systems, contributing to improved symptom management and overall health outcomes (Blumenthal et al., 2024). Systematic reviews confirm that integrating these processes within care coordination interventions leads to enhanced quality of care and patient satisfaction (Connor, 2023). The intervention's focus on standardized workflows with accountability mechanisms is supported by evidence demonstrating that targeted coordination improves continuity, patient safety, and efficiency in care delivery (Möckli et al., 2023).\n\n\n\n\n[TABLE] Simple Title of Project (Title should be same on feasibility document, DNP Project paper, site permission letter, and IRB)\n[TABLE]  \"Improving Initial Care Coordination Outreach for Members at ILS \"\n\n\n\n\n\n[TABLE] PICO Statement \n[TABLE] P (Population/Problem): Members enrolled in the Plan of Focus (POF) program at ILS Texas requiring care coordination\n\nI (Intervention): Implementation of a standardized initial outreach protocol including timely contact attempts, verification of member information, and documented follow-up\n\nC (Comparison): Current inconsistent and non-standardized first contact outreach processes\n\nO (Outcome): Increased successful first contact rate and improved timeliness of care coordination initiation within three months\nPICO Question:\n, how does implementing a standardized initial outreach protocol compared to current practice  the success rate and timeliness of first contact and care coordination initiation over a three-month period?\n\n\n\n\n\n[TABLE] Instrument (s) to measure outcomes\n[TABLE] \nTo measure outcomes for this quality improvement project, several validated instruments and data sources can be used to assess the effectiveness of the care coordination intervention:\nCare Management Dashboard and Outreach Logs: Electronic health record (EHR) or care management system reports tracking the number and timeliness of first contact attempts and documenting outcomes of each outreach effort. This tool allows quantitative measurement of the successful first contact rate (Taskforce on Telehealth Policy (TTP) - Data Flow, Care Coordination and Quality Measurement - NCQA, 2020).\n\nCare Coordination Measures Atlas (AHRQ): A compendium of validated care coordination process and outcome measures that can guide data collection on activities such as referral tracking, information sharing, and patient engagement (Honsberger, 2022).\nStaff Compliance Audits: Periodic review of care coordinators’ documentation to ensure adherence to the outreach protocol and documentation standards (Honsberger, 2022).\nQuality Improvement Monitoring Tools: Use of performance dashboards and regular report summaries, such as the Care Team Insights or Care Coordination Applications, to monitor ongoing trends and effectiveness of interventions (May 2025 ACO REACH Model PY 2025 Quality Measurement Methodology Report, 2025).\nThese instruments collectively enable both quantitative and qualitative evaluation of the intervention's impact on care coordination processes and member engagement.\n\n[TABLE] Site Permission and Practice Partner Agreement\n[TABLE]  Submitted to Workroom: ⃝ Not submitted (please contact the project chair and the Director) : ⃝ \n\n\n[TABLE] Project Proposal Decision:\n[TABLE] Draft Accepted ⃝ Revisement Necessary: ⃝ Comment for Revisement: \n\nFinal Version Graded Assignment: Approved ⃝ Revisement \nNecessary: ⃝ \nComment for Revisement:  \n",
  "Dorthia Daudier Feasibility Draft (1).docx_sections": [
    "Problem Statement",
    "Feasibility",
    "Measurement",
    "Evaluation",
    "Timeline",
    "Evidence",
    "Comment"
  ]
}